Repository: nitsan-technologies/ns_t3ai_localization
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# module.translation
source: Translation
de: Übersetzung

# translation.extensions-localization-xlf
source: Extensions Localization (XLF)
de: Erweiterungen Lokalisierung (XLF)

# create.localization
source: New Localization (XLF)
de: Neue Lokalisierung (XLF)

# translation.extensions-localization-xlf.desc
source: Make your TYPO3 extensions for a global audience with easy-to-use XLF file AI translations for easy localization.
de: Machen Sie Ihre TYPO3-Extensions für ein globales Publikum mit einfach zu bedienenden XLF-Datei AI Übersetzungen für eine einfache Lokalisierung.

# translation.extensions-localization-xlf.btn
source: Start AI Localizing
de: Start AI-Lokalisierung

# localization
source: Localization/Translation
de: Lokalisierung/Übersetzung

# traslation.module.installExtensions
source: Installed Extensions
de: Installierte Erweiterungen

# traslation.module.translate.file_name
source: Choose the default language file name
de: Dateiname der Standardsprache auswählen

# traslation.module.translate.mode
source: Translation Mode
de: Übersetzungsmodus

# traslation.module.translate.option1
source: Translate the entire file and overwrite any existing translations
de: Die gesamte Datei übersetzen, bestehende Übersetzungen überschreiben

# traslation.module.translate.option2
source: Translate only the missing items
de: Nur fehlende Elemente übersetzen

# traslation.module.translateBtn
source: Translate File
de: Datei übersetzen

# traslation.module.translate.targetLanguage
source: Choose the target language
de: Wählen Sie die Zielsprache

# traslation.module.translate.extension
source: Select Extension
de: Erweiterung auswählen

# confirmModal.yes
source: Yes, discard my changes.
de: Ja, verwerfe meine Änderungen

# confirmModal.cancel
source: No, I will continue editing.
de: Nein, ich werde weiter bearbeiten.

# confirmModal.currentPage.modal.message
source: Are you sure you want to discard these changes?
de: Sind Sie sicher, dass Sie diese Änderungen verwerfen wollen?

# confirmModal.newPage.modal.header
source: Do you want to close without saving?
de: Möchten Sie schließen, ohne zu speichern?

# NsT3Ai.rte.cancel
source: Cancel
de: Abbrechen
